{
  "garments": [
    {
      "name": "Однобортный пиджак",
      "description": "Классический пиджак с одним рядом пуговиц и перекрывающимися передними полочками",
      "garment_type": "Верхняя одежда",
      "formality_level": "Формальный",
      "construction_details": "Структурирован с бортовой прокладкой, пристегнутые вручную лацканы, функциональные петли на рукавах. Имеет нагрудный карман, карманы с клапанами и внутренние карманы. Конструкция плеча может быть естественной, с валиком или на подплечниках.",
      "key_features": "Английские или пиковые лацканы, конфигурация с 1-3 пуговицами (2 пуговицы наиболее распространены), центральная шлица или боковые шлицы, структурированные плечи",
      "historical_context": "Эволюционировал из военных и верховых пальто в 19 веке. Современный однобортный пиджак стал стандартной деловой одеждой в 20 веке.",
      "styling_tips": "Пиджаки с двумя пуговицами наиболее универсальны для бизнеса. Застегивать только верхнюю пуговицу при стоянии. Пиджак должен слегка касаться плеч при ношении. Рукав должен показывать 1-1,5см манжеты рубашки.",
      "image_url": "https://source.unsplash.com/800x600/?suit,jacket,businessman,formal",
      "language": "ru"
    },
    {
      "name": "Двубортный пиджак",
      "description": "Формальный пиджак с двумя параллельными рядами пуговиц и широким перекрытием",
      "garment_type": "Верхняя одежда",
      "formality_level": "Формальный",
      "construction_details": "Аналогичная конструкция однобортному, но с более широким передним перекрытием, требующим дополнительной ткани. Пиковые лацканы наиболее распространены. Требует точного баланса и расположения пуговиц.",
      "key_features": "4-6 пуговиц (обычно 6x2 или 4x2 конфигурация), пиковые лацканы, более широкое переднее перекрытие, более формальный вид",
      "historical_context": "Изначально военная и морская форма. Стал гражданской формальной одеждой в 1930-40е годы. Пережил возрождение в 1980-х и современной моде.",
      "styling_tips": "Держать застегнутым при стоянии (в отличие от однобортного). Лучше всего носят высокие люди из-за визуального веса. Чрезвычайно формальный и авторитетный вид.",
      "image_url": "https://source.unsplash.com/800x600/?double-breasted,jacket,formal,suit",
      "language": "ru"
    },
    {
      "name": "Классическая рубашка",
      "description": "Формальная рубашка, предназначенная для ношения с костюмами или под пиджаками",
      "garment_type": "Рубашка",
      "formality_level": "Деловая",
      "construction_details": "Изготовлена из хлопка или хлопковой смеси, поплина или бродклота. Имеет конструкцию воротника с прокладкой, планку для пуговиц, манжеты на пуговицах или французские манжеты, кокетку для формы плеча.",
      "key_features": "Воротник и манжеты, предназначенные для ношения с галстуками и пиджаками, более длинный подол для заправки, формальная планка для пуговиц",
      "historical_context": "Эволюционировала из нижнего белья, став незаменимой деловой одеждой. Белая классическая рубашка остается самым формальным вариантом.",
      "styling_tips": "Белые и светло-голубые - наиболее универсальные цвета. Воротник должен подходить с местом для двух пальцев. Манжеты должны выступать на 1-1,5см за рукав пиджака.",
      "image_url": "https://source.unsplash.com/800x600/?dress-shirt,white-shirt,formal,business",
      "language": "ru"
    },
    {
      "name": "Классические брюки",
      "description": "Формальные брюки, предназначенные для пары с пиджаками или блейзерами",
      "garment_type": "Брюки",
      "formality_level": "Деловые",
      "construction_details": "Приталенный крой через талию, бедра и ноги. Включают пояс с застежкой на крючок и планку, шлевки для ремня или боковые регуляторы, передние складки (опционально), задние карманы, отглаженную стрелку по центру спереди и сзади.",
      "key_features": "Могут быть с прямой передней частью или со складками, разрыв определяет длину, отвороты опциональны, обычно шерсть или смесь шерсти",
      "historical_context": "Отделились от концепции костюма в середине 20 века, позволяя деловой одежде в стиле mix-and-match. Складки более традиционны, прямая передняя часть более современна.",
      "styling_tips": "Длина должна создавать небольшой залом на обуви для формальной одежды, без залома для современного узкого кроя. Складки должны лежать плоско при стоянии.",
      "image_url": "https://source.unsplash.com/800x600/?trousers,dress-pants,formal,menswear",
      "language": "ru"
    },
    {
      "name": "Блейзер",
      "description": "Структурированный пиджак однотонного цвета или с узором, менее формальный, чем пиджак от костюма",
      "garment_type": "Верхняя одежда",
      "formality_level": "Деловая",
      "construction_details": "Аналогичная конструкция пиджаку костюма, но часто без подкладки или с половинной подкладкой. Может иметь металлические пуговицы (морской стиль) или стандартные пуговицы. Менее жесткая структура, чем формальные костюмы.",
      "key_features": "Накладные карманы распространены, металлические пуговицы опциональны, темно-синий наиболее традиционный, можно носить с несоответствующими брюками",
      "historical_context": "Произошел от британских морских пиджаков. Стал американским preppy основным в середине 20 века. Теперь мост между формальной и повседневной одеждой.",
      "styling_tips": "Темно-синий блейзер с серыми брюками - классическое сочетание. Можно одеть вверх с галстуком или вниз без. Универсален для деловой повседневной обстановки.",
      "image_url": "https://source.unsplash.com/800x600/?blazer,navy,jacket,casual",
      "language": "ru"
    },
    {
      "name": "Пальто",
      "description": "Длинное формальное пальто, надеваемое поверх костюмов для тепла в холодную погоду",
      "garment_type": "Верхняя одежда",
      "formality_level": "Формальный",
      "construction_details": "Изготовлено из тяжелой шерсти, часто с подкладкой и возможной промежуточной подкладкой для тепла. Простирается ниже колена для традиционного стиля, до середины бедра для современных кроев. Втачные рукава с местом для слоев.",
      "key_features": "Полная длина (за колено), формальный вид, структурированные плечи, часто имеет заднюю шлицу для движения",
      "historical_context": "Незаменимая одежда 19 и начала 20 веков до появления отапливаемого транспорта. Остается формальной холодной погоды верхней одеждой.",
      "styling_tips": "Должно быть место для удобного ношения пиджака костюма под ним. Угольный, темно-синий и верблюжий - наиболее универсальные цвета. Длина зависит от роста и пропорций.",
      "image_url": "https://source.unsplash.com/800x600/?overcoat,coat,winter,formal",
      "language": "ru"
    },
    {
      "name": "Жилет",
      "description": "Безрукавный предмет одежды, надеваемый поверх рубашки и под пиджаком в костюмах-тройках",
      "garment_type": "Верхняя одежда",
      "formality_level": "Формальный",
      "construction_details": "Пошит для плотной посадки к торсу. Спинка обычно из шелка или атласа с регулируемым ремешком для посадки. Передняя часть соответствует ткани костюма. Обычно пять или шесть пуговиц.",
      "key_features": "Без воротника (обычно), V-образный вырез спереди, регулируемый задний ремешок, формальный или повседневный в зависимости от стиля",
      "historical_context": "Изначально назывался жилет в Великобритании, vest в США. Часть классического костюма-тройки. Стал опциональным в эволюции casual 20 века.",
      "styling_tips": "Нижняя пуговица традиционно оставляется незастегнутой. Должен полностью покрывать пояс при стоянии. Можно носить без пиджака в деловой повседневной обстановке.",
      "image_url": "https://source.unsplash.com/800x600/?waistcoat,vest,three-piece,suit",
      "language": "ru"
    },
    {
      "name": "Смокинг (Вечерний пиджак)",
      "description": "Формальный вечерний пиджак с атласными или гросгрейновыми отворотами, носится с бабочкой на мероприятиях black-tie",
      "garment_type": "Вечерняя одежда",
      "formality_level": "Черный галстук",
      "construction_details": "Аналогичен пиджаку костюма, но с шелковыми отворотами на лацканах, карманах и пуговицах. Боковые регуляторы на брюках вместо петель для ремня. Однобортный с шалевыми, пиковыми или английскими лацканами (шалевые наиболее формальны).",
      "key_features": "Шелковые отворотыатласные или гросгрейновые, обтянутые пуговицы, одна пуговица, без шлиц (традиционно), носится с плиссированной или пикейной рубашкой",
      "historical_context": "Разработан в 1860-х как менее формальная альтернатива фраку для ужина дома. Назван в честь Таксидо Парк, где стал популярен в Америке. Теперь стандартная одежда black-tie.",
      "styling_tips": "Всегда черный или темно-синий. Носить с бабочкой (никогда с галстуком). Одна пуговица, всегда застегнута. Лакированные туфли. Белый платок в кармане. Сдержанная элегантность - ключ.",
      "image_url": "https://source.unsplash.com/800x600/?tuxedo,black-tie,formal,bow-tie",
      "language": "ru"
    },
    {
      "name": "Оксфордская рубашка с воротником на пуговицах",
      "description": "Повседневная рубашка с мягким воротником на пуговицах, элемент американского стиля Ivy League",
      "garment_type": "Рубашка",
      "formality_level": "Деловая повседневная",
      "construction_details": "Изготовлена из оксфордской ткани (корзиночное переплетение хлопка), воротник с пуговицами на концах, нагрудный карман (обычно), мягкий неукрепленный воротник. Складка коробкой на спине для движения.",
      "key_features": "Воротник на пуговицах, оксфордская ткань, мягкий неструктурированный воротник, нагрудный карман, элегантная небрежность",
      "historical_context": "Пуговицы на воротнике изобретены Brooks Brothers в 1896 после игроков в поло. Стала униформой Ivy League. Теперь стандарт умной повседневности.",
      "styling_tips": "Можно носить с галстуком или без. Подходит под блейзеры или отдельно. Белая и голубая наиболее классические. Легкий изгиб воротника характерен и желателен.",
      "image_url": "https://source.unsplash.com/800x600/?oxford-shirt,button-down,casual,shirt",
      "language": "ru"
    },
    {
      "name": "Чиносы",
      "description": "Повседневные хлопковые брюки твил, мост между джинсами и классическими брюками",
      "garment_type": "Брюки",
      "formality_level": "Умная повседневность",
      "construction_details": "Изготовлены из хлопкового твила, прямой крой или одна складка, наклонные передние карманы, задние карманы с рамкой или клапаном. Более легкая конструкция чем классические брюки, но более утонченная чем джинсы.",
      "key_features": "Ткань хлопковый твил, повседневный стиль, универсальные цвета (хаки, темно-синий, оливковый), расслабленный но приталенный крой",
      "historical_context": "Изначально военная форма (британская и американская армии в тропическом климате). Название от китайской ткани твил. Стала американским повседневным элементом в середине 20 века.",
      "styling_tips": "Темно-синие и хаки наиболее универсальны. Сочетать с блейзерами для умной повседневности или поло для casual. Можно с манжетами или без. Крой должен быть чистым но не обтягивающим.",
      "image_url": "https://source.unsplash.com/800x600/?chinos,khaki,casual,trousers",
      "language": "ru"
    },
    {
      "name": "Тренч",
      "description": "Водонепроницаемое пальто с военным происхождением, характерные детали как эполеты и пояс на талии",
      "garment_type": "Верхняя одежда",
      "formality_level": "Умная повседневность",
      "construction_details": "Изначально хлопковый габардин (Burberry) или вентильный хлопок. Двубортная передняя часть, пояс на талии, плечевые эполеты, кокетка на спине с дождевым щитом, ремешки на запястьях. Современные версии могут использовать синтетические водонепроницаемые ткани.",
      "key_features": "Двубортный, с поясом, эполеты, ветрозащитный клапан, D-кольца, реглан или втачные рукава, длина до колена или длиннее",
      "historical_context": "Разработан Burberry и Aquascutum для британских офицеров WWI. Военные детали сохранились: эполеты для знаков различия, D-кольца для снаряжения. Стал гражданской классикой после войны.",
      "styling_tips": "Бежевый/хаки наиболее классический, но темно-синий хорошо работает. Пояс можно завязать или застегнуть. Подходит поверх костюмов или с джинсами. Вневременной стиль который работает формально или повседневно.",
      "image_url": "https://source.unsplash.com/800x600/?trench-coat,raincoat,beige,coat",
      "language": "ru"
    },
    {
      "name": "Спортивный пиджак",
      "description": "Повседневный пиджак из текстурированной или узорчатой ткани, самый расслабленный вариант приталенного пиджака",
      "garment_type": "Верхняя одежда",
      "formality_level": "Повседневный",
      "construction_details": "Более мягкая конструкция чем пиджаки костюмов, часто без подкладки или частично на подкладке. Изготовлен из текстурированных тканей как твид, вельвет или лен. Накладные карманы распространены. Более свободная посадка.",
      "key_features": "Текстурированные или узорчатые ткани, накладные карманы, повседневный стиль, более мягкая конструкция, ассоциации с загородной или выходной одеждой",
      "historical_context": "Изначально для загородных видов спорта и выходных, отличаясь от городских деловых костюмов. Твидовые пиджаки особенно ассоциируются с британской загородной жизнью.",
      "styling_tips": "Сочетается с джинсами или чиносами для выходных. Твид для осени/зимы, лен или хлопок для весны/лета. Может иметь налокотники для дополнительного загородного характера. Самый повседневный приталенный вариант.",
      "image_url": "https://source.unsplash.com/800x600/?tweed,sport-coat,casual,jacket",
      "language": "ru"
    },
    {
      "name": "Поло",
      "description": "Трикотажная хлопковая рубашка с воротником и планкой, сочетающая комфорт с элегантным видом",
      "garment_type": "Рубашка",
      "formality_level": "Умная повседневность",
      "construction_details": "Связана из хлопкового пике или джерси. Ребристый воротник и манжеты рукавов, планка на 2-3 пуговицы. Боковые разрезы для комфорта. Может иметь нагрудный карман.",
      "key_features": "Трикотажная конструкция, воротник, планка с пуговицами, удобная, повседневная но утонченная",
      "historical_context": "Изобретена Рене Лакостом в 1926 для тенниса. Заменила тканые теннисные рубашки. Стала американским preppy элементом и стандартом умной повседневности по всему миру.",
      "styling_tips": "Заправленная или навыпуск в зависимости от формальности. Подходит под блейзеры или отдельно. Однотонные цвета наиболее универсальны. Крой должен быть приталенным но не обтягивающим. Воротник должен сохранять форму.",
      "image_url": "https://source.unsplash.com/800x600/?polo-shirt,casual,shirt,sport",
      "language": "ru"
    }
  ]
}