{
  "terms": [
    {
      "term": "Наметка",
      "definition": "Временная строчка длинными, легко удаляемыми стежками для удержания ткани на месте во время примерки или перед постоянным шитьем. Незаменима для переделок и индивидуального портновства.",
      "category": "Конструирование",
      "pronunciation": "na-MYO-tka",
      "image_url": null,
      "language": "ru"
    },
    {
      "term": "Горловина",
      "definition": "Шов, где воротник пиджака встречается с лацканом. Высота и угол горловины значительно влияют на стиль и формальность пиджака.",
      "category": "Портновство",
      "pronunciation": "gor-lo-VEE-na",
      "image_url": null,
      "language": "ru"
    },
    {
      "term": "Пройма",
      "definition": "Отверстие пиджака или рубашки, где прикрепляется рукав. Правильное измерение и конструкция проймы крайне важны для комфорта и диапазона движения.",
      "category": "Портновство",
      "pronunciation": "PRO-y-ma",
      "image_url": null,
      "language": "ru"
    },
    {
      "term": "Залом",
      "definition": "Насколько штанина брюк ложится на обувь. Варианты включают без залома (современный, короче), легкий залом (современный), средний залом (традиционный), или полный залом (одна полная складка на обуви).",
      "category": "Портновство",
      "pronunciation": "za-LOM",
      "image_url": null,
      "language": "ru"
    },
    {
      "term": "Приталивание",
      "definition": "Портновская техника сужения или стягивания талии пиджака для создания более выраженного V-образного силуэта и подчеркивания торса.",
      "category": "Переделки",
      "pronunciation": "pri-ta-li-VA-ni-ye",
      "image_url": null,
      "language": "ru"
    },
    {
      "term": "Пришивание прокладки",
      "definition": "Техника ручного шитья с использованием небольших диагональных стежков для прикрепления прокладки к ткани, создавая залом и форму в лацканах и воротниках. Признак качественного портновства.",
      "category": "Конструирование",
      "pronunciation": "pri-shi-VA-ni-ye pro-KLAD-ki",
      "image_url": null,
      "language": "ru"
    },
    {
      "term": "Бортовка",
      "definition": "Слой жесткой ткани (традиционно из конского волоса и шерсти), размещенный между внешней тканью и подкладкой пиджака для обеспечения структуры и формы. Полная бортовка простирается по всей груди; половинная бортовка только в области груди; клеевая использует клеевую прокладку вместо этого.",
      "category": "Конструирование",
      "pronunciation": "bor-TOV-ka",
      "image_url": null,
      "language": "ru"
    },
    {
      "term": "Косая",
      "definition": "Диагональное направление ткани под углом 45 градусов к кромке. Ткань, вырезанная по косой, имеет максимальную растяжимость и драпировку, используется для окантовки краев и создания текучих изделий.",
      "category": "Конструирование",
      "pronunciation": "ko-SA-ya",
      "image_url": null,
      "language": "ru"
    },
    {
      "term": "Кромка",
      "definition": "Законченный край тканого полотна, который идет параллельно нитям основы. Не осыпается и указывает на прямое зерно ткани.",
      "category": "Конструирование",
      "pronunciation": "KROM-ka",
      "image_url": null,
      "language": "ru"
    },
    {
      "term": "Долевая",
      "definition": "Направление нитей в тканом полотне. Продольная долевая идет параллельно кромке (нити основы), поперечная долевая идет перпендикулярно кромке (нити утка), а косая - диагональ.",
      "category": "Конструирование",
      "pronunciation": "do-lye-VA-ya",
      "image_url": null,
      "language": "ru"
    },
    {
      "term": "Ворс",
      "definition": "Поднятая поверхность на ткани, созданная концами волокон, дающая направленную текстуру. Бархат, вельвет и некоторые шерсти имеют ворс. Все детали выкройки должны быть вырезаны в одном направлении для постоянного внешнего вида.",
      "category": "Конструирование",
      "pronunciation": "VORS",
      "image_url": null,
      "language": "ru"
    },
    {
      "term": "Надсечка",
      "definition": "Небольшой V-образный разрез в припуске шва, используемый для маркировки размещения выкройки или подрезки изгибов. Также относится к стилю английского лацкана, где воротник и лацкан встречаются под углом.",
      "category": "Конструирование",
      "pronunciation": "nad-SECH-ka",
      "image_url": null,
      "language": "ru"
    },
    {
      "term": "Пиковый лацкан",
      "definition": "Стиль лацкана, где концы лацкана направлены вверх к плечу. Более формален, чем английский лацкан, часто встречается на двубортных пиджаках и смокингах.",
      "category": "Дизайн",
      "pronunciation": "PEE-ko-vy la-tsan",
      "image_url": null,
      "language": "ru"
    },
    {
      "term": "Шальный воротник",
      "definition": "Закругленный воротник и лацкан, вырезанные как одна непрерывная деталь без шва горловины. Самый формальный стиль лацкана, обычно встречается на смокингах и курительных пиджаках.",
      "category": "Дизайн",
      "pronunciation": "SHAL-ny vo-rot-NIK",
      "image_url": null,
      "language": "ru"
    },
    {
      "term": "Планка",
      "definition": "Открытие или разрез в одежде, обычно с обработанными краями. Распространена на передах рубашек (планка для пуговиц), манжетах и вырезах.",
      "category": "Конструирование",
      "pronunciation": "PLAN-ka",
      "image_url": null,
      "language": "ru"
    },
    {
      "term": "Кокетка",
      "definition": "Приталенная часть одежды на плечах или бедрах, от которой свисает остальная часть одежды. Кокетки рубашек обеспечивают форму плеча и декоративную деталь.",
      "category": "Конструирование",
      "pronunciation": "ko-KYE-tka",
      "image_url": null,
      "language": "ru"
    },
    {
      "term": "Ластовица",
      "definition": "Треугольный или ромбовидный кусок ткани, вставленный для добавления прочности или обеспечения движения в областях нагрузки, таких как подмышки или промежность.",
      "category": "Конструирование",
      "pronunciation": "las-to-VEE-tsa",
      "image_url": null,
      "language": "ru"
    },
    {
      "term": "Прокладка",
      "definition": "Слой ткани, помещенный между внешней тканью и подкладкой для добавления структуры, поддержки и формы. Может быть пришивной или клеевой (приглаживаемой). Незаменима в воротниках, манжетах и поясах.",
      "category": "Конструирование",
      "pronunciation": "pro-KLAD-ka",
      "image_url": null,
      "language": "ru"
    },
    {
      "term": "Подкладочная ткань",
      "definition": "Слой ткани, вырезанный идентично деталям изделия и обрабатываемый как один с основной тканью во время конструирования. Добавляет тело и структуру по всему изделию.",
      "category": "Конструирование",
      "pronunciation": "pod-KLA-doch-na-ya TKAN",
      "image_url": null,
      "language": "ru"
    },
    {
      "term": "Градуирование швов",
      "definition": "Обрезка припусков швов до разной ширины для уменьшения объема, особенно важно в изогнутых швах и толстых тканях. Создает более гладкие, плоские швы.",
      "category": "Конструирование",
      "pronunciation": "gra-du-i-RO-va-ni-ye SHVOV",
      "image_url": null,
      "language": "ru"
    },
    {
      "term": "Посадка",
      "definition": "Дополнительная полнота, введенная в шов для создания формы без сборок или вытачек. Незаменима для втачивания рукавов и создания изогнутых швов. Также относится к посадочной свободе - дополнительное пространство сверх мерок тела для комфорта и движения.",
      "category": "Конструирование",
      "pronunciation": "po-SAD-ka",
      "image_url": null,
      "language": "ru"
    },
    {
      "term": "Заказной пошив",
      "definition": "Изготовленная на заказ одежда, созданная с нуля для индивидуального клиента с несколькими примерками. Настоящий заказной пошив включает ручную раскройку выкройки и значительную ручную работу. Высший уровень индивидуального портновства.",
      "category": "Портновство",
      "pronunciation": "za-kaz-NOY PO-shiv",
      "image_url": null,
      "language": "ru"
    },
    {
      "term": "Пошив по меркам",
      "definition": "Одежда, созданная из существующей выкройки, скорректированной под индивидуальные мерки. Менее дорого, чем заказной пошив с меньшим количеством примерок, но все еще индивидуализировано для клиента.",
      "category": "Портновство",
      "pronunciation": "PO-shiv po MER-kam",
      "image_url": null,
      "language": "ru"
    },
    {
      "term": "Отделочная строчка",
      "definition": "Декоративная техника ручного шитья, создающая небольшие, равномерно расположенные стежки вдоль краев лацканов и карманов. Признак качественного портновства и ручной отделки.",
      "category": "Портновство",
      "pronunciation": "ot-DYE-loch-na-ya STROCH-ka",
      "image_url": null,
      "language": "ru"
    }
  ]
}
